nc: 80

scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]      # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]     # 1-P2/4
  - [-1, 3, C2f, [128, True]]      # 2-P2/4
  - [-1, 1, Conv, [256, 3, 2]]     # 3-P3/8
  - [-1, 6, C2f, [256, True]]      # 4-P3/8
  - [-1, 1, Conv, [512, 3, 2]]     # 5-P4/16
  - [-1, 6, C2f, [512, True]]      # 6-P4/16
  - [-1, 1, Conv, [1024, 3, 2]]    # 7-P5/32
  - [-1, 3, C2f, [1024, True]]     # 8-P5/32
  - [-1, 1, SPPF, [1024, 5]]       # 9

head:
  # P5 -> P4
  - [-1, 1, Conv, [512, 1, 1]]                 # 10
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 11
  - [[-1, 6], 1, Bi_FPN, [2]]                  # 12
  - [-1, 3, C2f, [512]]                        # 13

  # P4 -> P3
  - [-1, 1, Conv, [256, 1, 1]]                 # 14
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 15
  - [[-1, 4], 1, Bi_FPN, [2]]                  # 16
  - [-1, 3, C2f, [256]]                        # 17

  # P3 -> P2
  - [-1, 1, Conv, [128, 1, 1]]                 # 18
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 19
  - [[-1, 2], 1, Bi_FPN, [2]]                  # 20
  - [-1, 3, C2f, [128]]                        # 21  P2/4

  # P2 -> P3
  - [-1, 1, Conv, [256, 3, 2]]                 # 22
  - [[-1, 17], 1, Bi_FPN, [2]]                 # 23
  - [-1, 3, C2f, [256]]                        # 24  P3/8

  # P3 -> P4
  - [-1, 1, Conv, [512, 3, 2]]                 # 25
  - [[-1, 13], 1, Bi_FPN, [2]]                 # 26
  - [-1, 3, C2f, [512]]                        # 27  P4/16

  # P4 -> P5
  - [-1, 1, Conv, [1024, 3, 2]]                # 28
  - [[-1, 9], 1, Bi_FPN, [2]]                  # 29
  - [-1, 3, C2f, [1024]]                       # 30  P5/32

  - [[21, 24, 27, 30], 1, Detect, [nc]]        # Detect(P2, P3, P4, P5)