# Ultralytics YOLO 🚀, AGPL-3.0 license
# ESA-YOLO based on YOLO11

nc: 80

scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, CAGB, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, CAGB, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 2, CAGB, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 2, CAGB, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]
  - [-1, 2, C2PSA, [1024]]

head:
  - [4, 1, Conv, [256]]
  - [6, 1, Conv, [256]]
  - [10, 1, Conv, [256]]

  - [12, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 2, CAGB, [256, False]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [4, 1, Conv, [256, 3, 2]]
  - [[-1, -2, 6], 1, Concat, [1]]
  - [-1, 2, CAGB, [256, False]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [2, 1, Conv, [256, 3, 2]]
  - [[-1, -2, 4], 1, Concat, [1]]
  - [-1, 2, CAGB, [256, False]]

  - [[21, -1], 1, Concat, [1]]
  - [-1, 2, CAGB, [256, False]]

  - [24, 1, Conv, [256, 3, 2]]
  - [26, 1, Conv, [256, 3, 2]]
  - [[-1, -2, 20, 17], 1, Concat, [1]]
  - [-1, 2, CAGB, [256, False]]

  - [20, 1, Conv, [256, 3, 2]]
  - [30, 1, Conv, [256, 3, 2]]
  - [[-1, -2, 16], 1, Concat, [1]]
  - [-1, 2, CAGB, [256, False]]

  - [[11, 26], 1, Fusion, ["weighted_fusion"]]
  - [[12, 30], 1, Fusion, ["weighted_fusion"]]
  - [[13, 34], 1, Fusion, ["weighted_fusion"]]

  - [[35, 36, 37], 1, ASPH, [nc]]