# YOLO11-P234-FASFFHead_RepVGG.yaml
# 相比较于jack基础版，所有C3k2_MLLABlock2已替换为C3k2_RepVGG
nc: 80  # number of classes

scales:
  n: [0.5, 0.25, 1024]
  s: [0.5, 0.5, 1024]
  m: [0.5, 1.0, 512]
  l: [1.0, 1.0, 512]
  x: [1.0, 1.5, 512]

cls_loss_type: bce
bbox_loss_type:
  iou_type: 'wiou'  # 或者 'giou'、'wiou'、'ciou' 等

backbone:
  [[-1, 1, Conv, [64, 3, 2]],        # 0: 320x320
   [-1, 1, Conv, [128, 3, 2]],       # 1: 160x160 (P2)
   [-1, 2, C3k2_RepVGG, [256, False, 0.25]],      # 由C3k2_MLLABlock2替换为C3k2_RepVGG
   [-1, 1, Conv, [256, 3, 2]],       # 3: 80x80 (P3)
   [-1, 2, C3k2_RepVGG, [512, False, 0.25]],      # 由C3k2_MLLABlock2替换为C3k2_RepVGG
   [-1, 1, Conv, [512, 3, 2]],       # 5: 40x40 (P4)
   [-1, 2, C3k2_RepVGG, [1024, True]],            # 由C3k2_MLLABlock2替换为C3k2_RepVGG
   [-1, 1, SPPF, [1024, 5]],         # 7 增强感受野
   [-1, 2, C2PSA, [1024]],           # 8 加深建模
   [-1, 1, Conv, [512, 1, 1]],       # 9 通道降维后输出给 P4
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 10 → 80x80 (P3增强)
   [[-1, 4], 1, Concat, [1]],        # 11
   [-1, 2, C3k2_RepVGG, [256, False]],           # 由C3k2_MLLABlock2替换为C3k2_RepVGG
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 13 → 160x160 (P2增强)
   [[-1, 1], 1, Concat, [1]],        # 14
   [-1, 2, C3k2_RepVGG, [128, False]]]           # 由C3k2_MLLABlock2替换为C3k2_RepVGG

head:
  [
    [-1, 1, Conv, [256, 3, 2]],      # 16 → 80x80
    [[-1, 11], 1, Concat, [1]],     # 17
    [-1, 2, C3k2_RepVGG, [256, False]],          # 由C3k2_MLLABlock2替换为C3k2_RepVGG
    [-1, 1, Conv, [512, 3, 2]],      # 19 → 40x40
    [[-1, 8], 1, Concat, [1]],       # 20
    [-1, 2, C3k2_RepVGG, [512, False]],          # 由C3k2_MLLABlock2替换为C3k2_RepVGG

    # FASFF 融合（自定义模块）
    [[15, 18, 21], 1, FASFFHead_Jack, ['nc']]  # 输入 P2, P3, P4
  ] 