# Ultralytics YOLO11 simplified AFPN-style comparison model

nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]
  - [-1, 2, C2PSA, [1024]]

head:
  - [4, 1, Conv, [256, 1, 1]] # 11 P3_in
  - [6, 1, Conv, [256, 1, 1]] # 12 P4_in
  - [10, 1, Conv, [256, 1, 1]] # 13 P5_in

  - [13, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 12], 1, AFPN, []]
  - [-1, 2, C3k2, [256, False]] # 16 P4_mid

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 11], 1, AFPN, []]
  - [-1, 2, C3k2, [256, False]] # 19 P3_out

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 16, 12], 1, AFPN, []]
  - [-1, 2, C3k2, [256, False]] # 22 P4_out

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, AFPN, []]
  - [-1, 2, C3k2, [256, True]] # 25 P5_out

  - [[19, 22, 25], 1, Detect, [nc]]
